#!/bin/bash
###################################################################################################
# esayops public tools
# file_ver: 1.0.0
# 查看系统负载
#
# create by Nano, 2016-7-1
# Copyright 2016 Nano Guo
# 本工具版权信息归作者所有，未经授权不可用于平台外的其它商业用途。
#
# Input variables:
#     
# Output variables:
#
# Usage:
#
###################################################################################################

echo "1. 使用top查看系统状况..."
echo "----------------------------------------------------------------------------------------------"
top -bn 1 | head -n 5
echo "----------------------------------------------------------------------------------------------"

echo""
echo "2. 使用iostat，查看系统磁盘IO状况..."
echo "----------------------------------------------------------------------------------------------"
which iostat > /dev/null 2>&1
if [ $? -eq 0 ];then
    iostat -x 2 3
else
    echo "未找到 iostat 命令. yum install sysstat"
fi
echo "----------------------------------------------------------------------------------------------"
echo ""

echo "3. 使用vmstat查看系统内存状况..."
echo "----------------------------------------------------------------------------------------------"
which vmstat > /dev/null 2>&1
if [[ $? -eq 0 ]];then
    vmstat 2 5
else
    echo "未找到 vmstat 命令."
fi
echo "----------------------------------------------------------------------------------------------"
echo ""

echo "4. 使用dstat检查系统内存、IO、CPU使用情况："
echo "----------------------------------------------------------------------------------------------"
which dstat > /dev/null 2>&1
if [ $? -eq 0 ];then
    dstat --top-mem --top-io --top-cpu --nocolor 1 10 > /tmp/dstat.txt
    cat /tmp/dstat.txt | tail -n 12
else
    echo "未找到dstat命令."
fi
echo "----------------------------------------------------------------------------------------------"
